---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.WidthOrDiameter
source: html/518560a8-999c-86f7-9e19-e78030b7822c.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.WidthOrDiameter Property

The diameter of the duct with round profile, or the width of the duct with other profiles. Units: (ft).

## Syntax (C#)
```csharp
public double WidthOrDiameter { get; }
```